[
  {
    "body": "Buildings along a river, Neckar River, Tuebingen, Baden-Wurttembery, Germany Wall Art, Canvas Prints, Framed Prints, Wall Peels | Great Big Canvas Skip Menu. Navigate to content in this page Accessibility Assistance, opens A D A page Tracking Favorites Cart My Account Track My Order My Favorites Help / Contact Us Shop By New! New Abstracts New Florals New Contemporary Art New Photography Gallery Walls Shop All New! Best Sellers Subjects Popular Abstracts Landscapes Flowers and Botanicals Animals and Wildlife People Scenery by Region Nature Closeups City Skylines Religious Art Vehicles and Transportation Scenery by Landscape Trees Seascapes Barns Mountains Countryside Lakes Waterfalls Lighthouses Sunsets Beaches Scenery by Region Italy Hawaii Canada Ireland Paris New Orleans Africa Greece Popular Wildlife Horses Birds Bison and Buffalo Cows & Bulls Dogs Elephants Deer Bears Shop All Subjects Colors Popular Red Art Orange Art Yellow Art Green Art Blue Art Purple Art Pink Art Multicolor Art Black and White Art Grey Art Palettes Olive Sprig Taupe, Linen, and Gray Blush and Blueberry Denim and Leather Autumn Gold Teal and Copper Charcoal, Onyx, and Ivory Persimmon and Olive Luxe Metallics Verdant and Sienna Shop All Colors Styles Popular Abstract Contemporary Fine Art Photography Vintage Figurative Typography Classic Retro Street Art Pop Art By Decor Style Farmhouse Mid Century Modern Glam Bohemian Coastal Traditional Scandinavian Minimalist Contemporary Modern By Period Modern Expressionism Impressionism Art Deco Cubism Art Nouveau Realism Renaissance Baroque & Rococo Classicism & Neoclassicism Shop All Styles Rooms Popular Living Room Kitchen Bedroom Bathroom Dining Room Foyer and Entryway Office Children's Room Art by Decor Style Farmhouse Mid Century Modern Glam Bohemian Coastal Traditional Scandinavian Minimalist Contemporary Modern Shop All Rooms Artists Featured Kent Youngstrom Eleanor Doughty Joyce Combs Grace Popp Julie Prichard Teis Albers NUMA Art Jennifer Paxton Parker RD Riccoboni John Asaro Featured Photographers Carmine Chiriaco Brandon Luther Ben Pipe Vedran Vidak Philippe Hugonnard Tim Kahane New from Joel Sartore Mark Gemmell Classic Artists Gustave Caillebotte John William Waterhouse Albert Williams George Inness Katsushika Hokusai Claude Monet Vincent van Gogh Pierre Auguste Renoir Paul Cezanne Rembrandt van Rijn Shop All Artists Featured Curator's Choice Arassay Hilario Pomegranate Noir Flamingo Pink A Digital Age West Coast Minimalism A Great Escape West Coast Cool Rugged Refinement Seasonal Collections Wabi - Sabi Twilight Blues Still Life and Florals Soft Summer Abstracts Olive Sprig Luxe Metallics Hello, Summer Dark Academia Art & Decor Trends Balance and Poise Celebration Of Color Compositions in Collage Street Art Punchy Pastels John James Audubon Katsushika Hokusai Dawn Trimble Shop All Featured Gallery Walls Inspiration Ideas Art & Decor Ideas Blog Back Track Your Order Returns & Exchanges Shipping Information Contact Us About Our Products About Great Big Canvas Trade Solutions for Designers Gift Cards Email Us +1 (800) 557-2520 Copyright (c) 2002-2023 by Circle Graphics, Inc. Use of this web site constitutes acceptance of the Terms of Service , Privacy Policy , and Cookie Policy. Individual images served from our catalog are copyright by their respective owners and used with permission. GREAT BIG CANVAS is a registered trademark of Circle Graphics, Inc. Buildings along a river, Neckar River, Tuebingen, Baden-Wurttembery, Germany Item # 101431 Bring high quality wall art into your home or office with a canvas print that will never warp or sag. Our solid faced canvas prints are 1.25\" thick and feature a sealed, finished back and pre-installed hanging hardware. It's designed to hang tough and is super easy to display. Explore our framed canvas print options for an eye-catching accent. Long-Lasting Color and Detail <p>Our giclee canvas wall art prints are reproduced with high quality, UV-resistant, environmentally-friendly, latex inks and artist grade, polycotton canvas. We pride ourselves on color accuracy and image clarity to ensure your new canvas print lasts for years to come.</p> Clean Corners and Finished Back <p>Our solid faced canvas prints feature a patented, warp-resistant design that produces outstanding gallery wraps. These 1.25\" thick wrapped canvas prints also include a sealed, enclosed back to keep out dust and protect your walls.</p> Lightweight and Easy to Install <p>Install your stunning new wall art in just minutes with our pre-installed sawtooth hanging hardware and easy-to-manage lightweight design. Even though they're light, our rock-solid construction boasts long-lasting durability.</p> <p>Featured image: <a href=\"/view/sunshine-and-love,2790040/?ref=pdp-feature\">Sunshine And Love by Nikki Chu</a>.</p> Photography Scenery by Region Europe Germany",
    "relevant": true,
    "server": "greatbigcanvas",
    "title": "Buildings along a river, Neckar River, Tuebingen, Baden-Wurttembery, Germany Wall Art, Canvas Prints, Framed Prints, Wall Peels | Great Big Canvas",
    "relevant_links": "[]",
    "all_harvested_links": "[]",
    "url": "https://www.greatbigcanvas.com/view/buildings-along-a-river-neckar-river-tuebingen-baden-wurttembery-germany,101431/"
  },
  {
    "body": "Reddit - Dive into anything Advertisement Reddit and its partners use cookies and similar technologies to provide you with a better experience. By accepting all cookies, you agree to our use of cookies to deliver and maintain our services and site, improve the quality of Reddit, personalize Reddit content and advertising, and measure the effectiveness of advertising. By rejecting non-essential cookies, Reddit may still use certain cookies to ensure the proper functionality of our platform. For more information, please see our Cookie Notice and our Privacy Policy . Open menu Open navigation Go to Reddit Home r/MachineLearning A chip A close button Get app Get the Reddit app Log In Log in to Reddit Expand user menu Open settings menu Log In / Sign Up Advertise on Reddit Get the Reddit app Scan this QR code to download the app now Or check it out in the app stores Popular TOPICS Gaming Valheim Genshin Impact Minecraft Pokimane Halo Infinite Call of Duty: Warzone Path of Exile Hollow Knight: Silksong Escape from Tarkov Watch Dogs: Legion Sports NFL NBA Megan Anderson Atlanta Hawks Los Angeles Lakers Boston Celtics Arsenal F.C. Philadelphia 76ers Premier League UFC Business GameStop Moderna Pfizer Johnson & Johnson AstraZeneca Walgreens Best Buy Novavax SpaceX Tesla Crypto Cardano Dogecoin Algorand Bitcoin Litecoin Basic Attention Token Bitcoin Cash Television The Real Housewives of Atlanta The Bachelor Sister Wives 90 Day Fiance Wife Swap The Amazing Race Australia Married at First Sight The Real Housewives of Dallas My 600-lb Life Last Week Tonight with John Oliver Celebrity Kim Kardashian Doja Cat Iggy Azalea Anya Taylor-Joy Jamie Lee Curtis Natalie Portman Henry Cavill Millie Bobby Brown Tom Hiddleston Keanu Reeves Animals and Pets Anime Art Cars and Motor Vehicles Crafts and DIY Culture, Race, and Ethnicity Ethics and Philosophy Fashion Food and Drink History Hobbies Law Learning and Education Military Movies Music Place Podcasts and Streamers Politics Programming Reading, Writing, and Literature Religion and Spirituality Science Tabletop Games Technology Travel RESOURCES About Reddit Advertise Help Blog Careers Press Coins Premium Communities Rereddit Topics Impressum Content Policy Privacy Policy User Agreement Reddit, Inc. (c) 2023. All rights reserved. Go to MachineLearning r/MachineLearning r/MachineLearning This subreddit is temporarily closed in protest of Reddit killing third party apps, see /r/ModCoord and /r/Save3rdPartyApps for more information. Members Online * by TomIsOK [D]Deciding between ML Masters in Germany (Saarland vs. Tuebingen) So I have been recently admitted to a relatively new Masters in Data Science and Artificial Intelligence at Saarland University to start in April of next year. I have read great things about the CS departments at Saarland, and the presence of the Max Planck Institute in Informatics + the German Research Center for Artificial Intelligence is really attractive for someone interested in developing an ML career, specially to someone interested in the Computer Vision + ML area like me, since the machine learning laboratory is very focused on this. Besides applying to Saarland, I was planning to apply to Tuebingen's Masters in Machine Learning when applications open next year. However, since Saarland admitted me this early, I will have to make a decision before I hear about the results of Tuebingen. If I accept the offer at Saarland, I would be looking to work as a Research assistant in one of these institutes (ideally with Prof. Bernt Schiele in the Computer Vision and Machine Learning lab) and after graduating, I would search for Machine Learning engineer jobs or if I really enjoy my experience with research, maybe pursue a PhD. The thing is that at the moment, I see myself more in the future in an industry environment rather than in academia. Because of this, what attracts me from Tuebingen is the presence of Amazon, Bosch, the Max Planck Institute for Intelligent Systems, and all of the current hype it is gaining recently from the \"Cyber Valley\" consortium ( https://cyber-valley.de/ ), all of which make Tuebingen look like a place where I could get an internship in one of these companies and then more easily transition into industry. Both universities seem to be really strong in ML research with amazing professors and opportunities in their respective laboratories, despite this, I can't help but feel that if I choose Saarland, I may be missing out on internships in Industry such as the ones I mentioned. Am I overthinking the weight of the nature internships in a Masters? (ML Research in laboratories vs ML Industry) It is also important for me to mention that I am from Venezuela, and while it may sound easy for some people to just defer the admission for the next semester to get an answer from Tuebingen and make a better decision, for me it can be a risk since the country can get worse economically and politically at any moment. Going to Saarland means starting in April, going to Tubingen (If I were to get accepted) means starting in October. I don't know if this is the right place to ask but since my doubts are based on the quality of both ML programs and the opportunities available at each university are in ML positions I thought I'd raise my concerns here. Edit: Just in case someone revisits or finds this post later. I ended up enrolling to Saarland University. Read more More posts you may like Related Machine learning Computer science Information & communications technology Applied science Formal science Technology Science forward back",
    "relevant": true,
    "server": "reddit",
    "title": "Reddit - Dive into anything",
    "relevant_links": "[]",
    "all_harvested_links": "[]",
    "url": "https://www.reddit.com/r/MachineLearning/comments/ee9fl6/ddeciding_between_ml_masters_in_germany_saarland/"
  },
  {
    "body": "Tubingen Travel Guide | Things To See In Tubingen - Sightseeings & Interesting Places Hotels Car Rental City Guide Extreme Spots 3D Cities About Us All countries Country selection Germany All cities & regions | Aachen Augsburg Baden-Baden Bavaria Berlin Bielefeld Binz Bochum Bonn Braunschweig Bremen Celle Cologne Cottbus Dachau Darmstadt Dessau Dortmund Dresden Duisburg Dusseldorf Eisenach Erfurt Essen Flensburg Frankfurt am Main Freiburg im Breisgau Garmisch-Partenkirchen Gelsenkirchen Gottingen Gronau Gummersbach Halle an der Saale Hamburg Hannover Heidelberg Ingolstadt Kaiserslautern Karlsruhe Kassel Kiel Koblenz Konstanz Landshut Langenfeld Leipzig Lemgo Leverkusen Lubeck Magdeburg Mainz Mannheim Monchengladbach Monschau Munich Munster Nurnberg Oberhausen Offenbach Oldenburg Osnabruck Paderborn Passau Potsdam Ratingen Regensburg Rostock Rust Saarbrucken Schwerin Stuttgart Thuringia Trier Tubingen Ulm Wiesbaden Winterberg Wolfsburg Wuppertal Wurzburg Zwickau Tubingen Guide to Tubingen Weather forecast Photo gallery Maps of Tubingen Interactive map Check hotel prices Car rental Hotel search in Tubingen Destination / Hotel Select your dates Sightseeing in Tubingen - what to see. Complete travel guide The famous university town and cultural center is one of the most beautiful areas of the southern Germany. The city is famous for numerous historic buildings, churches, castles and palaces. You will see restaurants and shops almost on every street of this place. Picturesque alleys and parks are simply perfectly suited for walking, so for many years Tuebingen is more than popular among foreign tourists. Bebenhausen Abbey is one of the oldest buildings in the city. The monastery was built in 1185 and it was kept in great state till our days. HAPlderlin Tower is an unusual colorful building that has been a part of a powerful fortress wall in the Middle Ages. The building has received its name after the famous German poet. Nowadays a small museum is opened here. Another architectural complex, which has been converted into a museum, is Castle Hohentubingen. The halls of the castle exhibit collections devoted to ethnology and history of world civilizations. The courtyard of the castle often hosts music concerts and performances. It has become one of the most popular cultural centers. Copyright www.orangesmile.com Wilhelmstrasse Street is considered the central street of the Old Town. Here you can see beautiful old buildings, the university library and a large botanical garden. One of the library's rooms exhibits valuable artifacts. These items were discovered by archaeologists in 1931. This is a collection of small figurines made of mammoth ivory. Eberhard Karls UniversitA$?t is definitely worth making a visit. The university was founded in the 15th century. The university's Planetarium is always open for visitors. Also don't forget to visit Cathedral Hall. Near the building of the university is located St. George Church, around which are installed beautiful monuments depicting nobles and princes. Tourists also have an opportunity to visit museums and theaters, modern art exhibitions and music concerts. The old Market Square is the starting point for many excursion programmes. The square is surrounded by beautiful half-timbered houses. The Neptune Fountaine is considered its main decoration. In the immediate vicinity of the square, you'll find a lot of significant historic buildings. Here is a 15-th century building of the Town Hall with an old astronomical clock. Nearby, is the amazing Kornhaus building - one of the most unusual architectural masterpieces of TA 1/4bingen. Once the building was used as a granary. Nowadays, it houses an attractive historical museum. Extremely popular are trips to Hohenzollern Castle. The castle is based on top of the mountain in the outskirts of the city. According to available historical data, it was built in the 11th century. The castle was completely destroyed during the regular Swabian siege in the early 15th century. However, in the middle of the century, it was fully restored. The last major reconstruction of the fortress took place in the 19th century. Since then its exterior and interior design have remained almost unchanged. The NeckarbrA 1/4cke Bridge is one of the favourite places to stroll around. It opens a breathtaking view of the colorful historic houses. You can pass over the bridge to the island of Neckar. Here, is one of the most beautiful gardens of TA 1/4bingen. This area is popular among lovers of beer. Not far from the bridge is found the historic NeckarmA 1/4ller brewery. Plenty of interesting holidays and festivals occur in the city throughout the year. In early December, the annual Chocolate Festival is held. You can taste a lot of amazing sweets meanwhile. Guests are offered traditional Belgian waffles with chocolate, sweets made from African chocolate, and decorated Italian desserts. Following the festival in TA 1/4bingen, the traditional Christmas Fair starts. Fabulous entertainment events take place in the city throughout the month. At the beginning of October, they spend Duck races - a really amusing holiday. The venue is the Neckar River. The essence of the event is very simple. Everyone can take part in the competition. You just need to buy a small rubber duck. The day of the race, they let ducks down the river. The winner gets significant prize money. This guide to iconic landmarks and sights of Tubingen is protected by the copyright law. You can re-publish this content with mandatory attribution: direct and active hyperlink to www.orangesmile.com . City tours, excursions and tickets in Tubingen and surroundings Reference information Map of all castles Survived castles around Tubingen  Castle 'Bebenhausen Abbey and Castle' , 3.2 km from the center. On the map Photo  Castle 'Achalm Castle' , 14.9 km from the center. On the map Photo  Castle 'Lichtenstein Castle' , 20.9 km from the center. On the map Photo  Castle 'Schloss Hohenheim' , 23.2 km from the center. On the map Photo  Castle 'Hohenzollern Castle' , 24.1 km from the center. On the map Photo Map of all parks National and city parks around Tubingen  National Park 'Schwarzwald' , 87.5 km from the center. On the map Photo Map of all art museums Art galleries in Tubingen and around  Art museum 'Kunstmuseum' Stuttgart, 28.8 km from the center. On the map Photo  Art museum 'Staatsgalerie' Stuttgart, 29.2 km from the center. On the map Photo Sights around Tubingen from our guide 'Extreme places on Earth' Bath Friedrichsbad From the series \"Most Extraordinary Thermaes, Baths and Saunas in the World\" Check on the map: Distance from Tubingen center - 64.6 km. Baths of Friedrichsbad are considered one of the most beautiful thermal complexes in the world. Despite their fascinating historical appearance, they are equipped with the latest technology. Visitors will have rest in an atmosphere of complete comfort. The building where the complex is located, has also a huge historical value. It is an excellent example of the Renaissance style. One of the main secrets of Baths of Friedrichsbad is an underground museum, which can be visited by all those wishing to explore the preserved walls of ancient Roman baths, which are more than 2000 years old. ... Read further Burg Hohenzollern From the series \"Amazing Ancient Fortresses Preserved to This Day\" Check on the map: Distance from Tubingen center - 24.1 km. The followers of the mystical stories can wander through the ancient underground vault. This is often the strong din, for which there is still no physical explanation. Perhaps the movement of air through the narrow underground corridors is the reason for this. The locals believe that the ghost lives in the underground vault. Throughout the year the interesting cultural events, which are dedicated to the national traditions and history of Baden-WA 1/4rttemberg, take place in the castle. In summer, the open-air cinema is set up on the Burgterritorium. ... Read further Car rental on OrangeSmile.com Detailed Tubingen maps Tubingen photo gallery i>>? Travel News Expo 2020 in Dubai Was Visited by More Than 7 Million Visitors If you haven't visited this event yet, there is still time to book a hotel in Dubai because Expo 2020 Dubai runs until 31 March 2022. People who are unable to visit the emirate can make a virtual tour on the Expo 2020 website. By the way, the virtual visitation has already reached 31.6 million by the end of December. Read this 28.06.2023 Search touristic sites on the map of Tubingen Address/Sight name City/Region Country Within radius, km Types of touristic objects to search for Hotels & Car rental Carhire locations 0 star 1 star 2 stars 3 stars 4 stars 5 stars Touristic places Art galleries Churches/Temples Museums Castles/Palaces Monuments Touristic areas Sightseeings Attractions Attraction parks Casino Theaters/Cinema Disco/Clubs Parks Zoo Aqua parks Transport Airports Train stations Bus stations Metro Parkings Fuel stations Ports/Ferries Health/Sport Fitness centers Bowling Spa Golf Stadiums Ski lifts Food/Money Banks/ATM Cafe Bars Restaurants Bakeries Supermarkets Shopping Shopping zones Shopping malls Department stores Jewelry stores Liquor stores Furniture stores Clothing stores Shoe stores Electronics stores Pet stores Book stores Bicycle stores Beauty/Medicine Beauty salons Hair care Physiotherapists Pharmacy Hospitals Dentists Doctors Veterinary care City services Post offices Police City halls Embassies Court houses Expo centers Libraries Universities Useful services Car wash Car repair Car dealers Movie rentals Real estate Laundry Campgrounds Travel agencies Sightseeing in regions nearby Tubingen Stuttgart However, the city is also one of most important and largest cultural centers in both Germany and Europe. Tenths of thousands of tourists arrive here to admire the churches of the city (Domkirche St. Eberhard, Stiftskirche Stuttgart, Leonhardskirche, Hospitalkirche) and enjoy the beauty of the cityas squares (Konigstrasse, Schlossplatz, Schillerplatz, Marktplatz). Simply no ... Open >> Baden-Baden The Lichtentaler Allee is one of the most famous sights of the city. Many tourists find a real pleasure in starting the new day with a walk among old trees and magnificent flowered beds. Many years ago such famous people as Tolstoy, Dostoevsky, Turgenev, Gogol and other walked on these valleys. Baden-Baden has traditionally been one of the most beloved places of rest among ... Open >> Ulm Ulm Cathedral is the main symbol of the city. The height of the main tower reaches 161 meters. This tower is considered the highest one in the world; its top is equipped with an observation deck, which features a breathtaking panorama of the city. The interior of the cathedral is also full of truly valuable items, many of which were made in the 15th century and so they are ... Open >> Strasbourg Strasbourg Cathedral, which is known far beyond the country, is, certainly, the main attraction of the city. This magnificent Gothic structure was built in the 7th century and for a long time this was the tallest building in Europe. Opposite to the cathedral is located another beautiful building - Rogan`s Palace, which halls hold the exhibition of the art museum. Here you can ... Open >> Heidelberg First mentions of Heidelberg in documents date back to 1196. These are the archives in Schonau Abbey, although, people lived in this region already in the 6th century. At that time, there was a fortress that had the same name as the city. Pfalz counts liked the area and decided to build a residence here. During the Thirty Yearsa War, Count Tilly captured the city and became ... Open >> Rust It is worthy of note that, contrary to current laws, Rust remains an independent territorial entity despite the fact that the number of its inhabitants is less than 2,000 people (according to the current legislation, to be able to self-government, the population of an Austrian city must be at least 20,000 people). Over the hundreds of years, the city has been improving and ... Open >> All about Tubingen, Germany - sightseeings, attractions, touristic spots, architecture, history, culture and cuisine. Prepare your trip together with OrangeSmile.com - find out the 'must see' things in Tubingen, which places to visit, which excursions to take, where the breathtaking views are waiting for you. Planning your trip with this travel guide will help your to get the most out of Tubingen in few days. OrangeSmile.com - online travel reservation expert providing reliable car rental and hotel booking services. We feature more than 25.000 destinations with 12.000 rental offices and 200.000 hotels worldwide. Secure Server Head office Weegschaalstraat 3, Eindhoven 5632 CW, The Netherlands +31 40 40 150 44 Terms of Service | Privacy Policy | About us Copyright (c) 2002 - OrangeSmile Tours B.V. | OrangeSmile.com | Under the direction and management of IVRA Holding B.V. - Registered at Kamer van Koophandel (KvK), The Netherlands No. 17237018",
    "relevant": true,
    "server": "orangesmile",
    "title": "Tubingen Travel Guide | Things To See In Tubingen - Sightseeings & Interesting Places",
    "relevant_links": "[]",
    "all_harvested_links": "[]",
    "url": "https://orangesmile.com/travelguide/tubingen/index.htm"
  },
  {
    "body": "Dictate of Opinion and \"Cancel Culture\" at the Tubingen City Festival About us About us Jobst and Charlotte Bittner Biography Schedule Invite Podcast What we believe History Pastors and Staff TOS Ministries Congregations Prayer Ministries Social Ministries Street Children Drug Rehab Humanitarian Aid Training Programs TOS Bible School Theological Seminary Eagle TOS School of Ministry Music & Arts Music Dance Drama Events All events Church services Bible Talks The Ninth Hour Church Life Activities Next Step Course Cell Groups Connect Student Group Youth Encounter Royal Rangers Children's Ministry Healing Room Meals for the Homeless Tabernacle Permanent Exhibition in Tubingen Events Live News Newsblog Podcasts TOS Ministries Jobst Bittner Newsletter Shop Bookstore Tuebingen Online Shop Donate Contact Office hours Get in touch Directions Intranet EN Deutsch English Francais Polska Pusskii Espanol News-Detail Dictate of Opinion and \"Cancel Culture\" at the Tubingen City Festival 07/13/2022 News Jobst Bittner0 Created by Jobst Bittner What the Tubingen City Festival and Berlin's Humboldt University have in Common The case at Berlin's Humboldt University sparked nationwide controversy. A handful of left-wing activists agitated there against a scientist who wanted to lecture on the fact that there are only two genders in biology. The activists' placards and posters were clear: \"No place for transphobia!\" \"Fuck off!\" \"No stage for transphobia!\" The event was eventually canceled by the university president due to security concerns. 1 In the university town of Tubingen, too, the agitation of queer demonstrators knows no bounds. The independent free church TOS had a booth at the city festival. The church sold pulled pork and presented a music program on Friday and Saturday with Christian music, dances and personal stories about God. A demonstration by the Christopher Street Day Movement, CSD Tubingen, in front of the TOS booth had been approved by the city on both days of the festival. Their posters spoke for themselves: \"No stage for the homophobic TOS\"; \"Fuck You\" and \"TOS, get out of Tubingen\". 2 Now and again, the demonstrators chanted: \"Don't buy from TOS\". Leaflets warned of a \"dangerous and destructive group\". Actually, the Tubingen city festival is supposed to celebrate peaceful coexistence. More than 30,000 visitors crowded the city festival, according to estimates by the city administration. However, the local radio station \"Wuste Welle\" had previously warned against the participation of the free church TOS. The program maker of the housing project \"Munzgasse 13\" spread his message over the airwaves: the free church TOS \"does not deserve\" to be part of the city festival. 3 Plus, they said, riots are to be expected. Incomprehensible that the city authorities authorized a demonstration of the CSD parallel to the City Festival as a kind of permanent subscription on both days for four hours, which was supposed to have its closing point at the time of the program at the stand of the free church TOS. The demonstrators criticized the city administration that TOS was represented at the City Festival with a booth and program. The city of Tubingen commented on this as follows: \"The city administration takes the position that a democratic urban society must also tolerate dissenting opinions. As long as the providers of programs at the City Festival adhere to the law and do not violate the constitution, we see no reason and no legal basis to prohibit them from participating in a city event. 4 What actually happens when left-wing activists and queer demonstrators do not abide by law and order? It is true: Most of the demonstrators peacefully held up their banners of opinion and distributed leaflets, the content of which would easily meet the definition of \"defamation\". But when individual activists chant \"Don't buy from TOS\", rip off posters, steal information material and actively ask visitors to leave the booth, it is no longer about the different positions in a democratic urban society, but simply about an opinion dictate and \"Cancel Culture\" at the Tubingen City Festival. If one listens to the activists, as some interested church members did, one learns how relentlessly these people want to push their agenda and exclude dissenters. However, you had to find the right people to talk to, since most of the demonstrators were not willing to talk due to a gag order that was obviously imposed from above . In the U.S., the phenomenon is called \"cancel culture\", where it poisons social debates and fuels the culture war between left and right: Certain positions are branded as discriminatory, which is why attempts are made to discredit and socially ostracize their representatives. 5 Unfortunately, this was also the point of the local radio station \"Wuste Welle\", which was broadcast live from the City Festival: to stigmatize the free church TOS as queer-hostile and homophobic and to discredit it as an inhumane religious cult. If you look more closely, it's actually about the inability to listen to each other and tolerate other points of view. The original important concern to stop racism and discrimination in everyday language has degenerated into an absurd censorship mania. The paradox is that, on the one hand, activists demand recognition of great diversity in lifestyles, worldviews, and sexual orientations; on the other hand, they categorically exclude attitudes other than their own. 6 So the lecture hall in Berlin becomes the place of the left-wing terror of a minority and the peaceful City Festival of Tubingen becomes the scene of a dictate of opinion apparently sanctioned by the city and publicly demonstrated by the CSD and other groups. This development gives cause for concern. Anyone who thinks differently apparently has to reckon with worse than insults. That is shameful. When we start to ban, exclude and deny the right to stay instead of treating each other respectfully in the case of controversial views and world views, we have long since left the basic democratic consensus of freedom of opinion and religion. Those who demonize and delegitimize others - and this explicitly includes Bible-believing free churches - and deny them their right to exist should not be surprised by an astonished comparison with the mindset of a time that has hopefully long since been overcome. Sources: 1 See Phillip Eppelsheim, Der Gesinnungsterror linker Aktivisten. Cancel Culture an der Uni (Dictate of Opinion by Left Activists. Cancel Culture at the University), article published on July 3, 2022, in: Frankfurter Allgemeine Zeitung (FAZ), online: https://www.faz.net/-gpg-asyf1 (last accessed: July 13, 2022). 2 SWR, Volle Altstadtgassen beim Tubinger Stadtfest (Crowded Alleys at the Tubingen City Festival), article published on July 10, 2022, available online: https://www.swr.de/swraktuell/baden-wuerttemberg/tuebingen/stadtfest-tuebingen-2022-100.html (last accessed: July 13, 2022). 3 Wuste Welle Mediathek, Ankundigungen zum Tubinger Stadtfest am 05.07.2022 (Announcements for the Tubingen City Festival on July 5, 2022), available online: https://www.wueste-welle.de/mediathek/playsendung/id/62002 (last accessed: July 12, 2022). See also: Wuste Welle, Stadtfestradio live vom 08. Juli 2022 (21.00 Uhr) (City Festival Radio live on July 8, 2022 (9p.m.)), available online: https://www.wueste-welle.de/mediathek/viewsendung/id/62078 (last accessed: July 13, 2022). 4 SWR, Volle Altstadtgassen beim Tubinger Stadtfest (Crowded Alleys at the Tubingen City Festival) . 5 See Florian Harms, Zensur made in Germany (Censorship, made in Germany), in: T-online, article published on July 7, 2022, available online: https://www.t-online.de/nachrichten/id_92351732/zensur-made-in-germany-was-darf-man-eigentlich-noch-sagen-.html (last accessed: July 13, 2022). 6 ibid. zuruck weiter Legal Notice Privacy Policy Press Donate Sitemap Modal title x x Anmeldung User login Enter your username and password here in order to log in on the website Login E-Mail Password Stay logged in Forgot your password?",
    "relevant": true,
    "server": "tos",
    "title": "Dictate of Opinion and \"Cancel Culture\" at the Tubingen City Festival",
    "relevant_links": "[]",
    "all_harvested_links": "[]",
    "url": "https://tos.info/en/newsblog/news-detail/dictate-of-opinion-and-cancel-culture-at-the-tuebingen-city-festival"
  }
]